Show / Hide Table of Contents
Class MatConcreteSIA
Material concrete SIA
Inheritance
System.Object
OpenObject
OpenElementId
Material
MatConcrete
MatConcreteSIA
Inherited Members
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Material
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Libraries.Material.SIA.MatConcreteSIA,CI.Material", "CI.StructModel.Libraries.Material.IMaterial,CI.BasicTypes", typeof(MatConcrete))]
public class MatConcreteSIA : MatConcrete
Properties
Improve this Doc   View Source
AggregateType
type of aggregate
Declaration
public ConcAggregateTypeSIA AggregateType { get; set; }
Property Value
 Type |  Description
 ConcAggregateTypeSIA
Improve this Doc   View Source
CalculateDependentValues
setting calculation dependent values on fck
Declaration
public bool CalculateDependentValues { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
CementClass
type of cement class
Declaration
public ConcCementClassSIA CementClass { get; set; }
Property Value
 Type |  Description
 ConcCementClassSIA
Improve this Doc   View Source
DiagramType
type of stress-strain diagram bilinear/parabolic/general for ULS calculation
Declaration
public ConcDiagramType DiagramType { get; set; }
Property Value
 Type |  Description
 ConcDiagramType
Improve this Doc   View Source
Ecm
secant modulus of elasticity of concrete
Declaration
public double Ecm { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Epsc1d
compressive strain in the concrete
Declaration
public double Epsc1d { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Epsc2d
compressive strain in the concrete
Declaration
public double Epsc2d { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fck
characteristic compressive cylinder strength of concrete at 28 days
Declaration
public double Fck { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fcm
mean value of concrete cylinder compressive strength
Declaration
public double Fcm { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fctk_0_05
characteristic axial tensile strength of concrete 5% quantile
Declaration
public double Fctk_0_05 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fctk_0_95
characteristic axial tensile strength of concrete 95% quantile
Declaration
public double Fctk_0_95 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fctm
mean value of axial tensile strength of concrete
Declaration
public double Fctm { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Nfc
conversion factor nfc
Declaration
public double Nfc { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
PlainConcreteDiagram
Stress strain diagram with tension part
Declaration
public bool PlainConcreteDiagram { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
StoneDiameter
diameter of stone
Declaration
public double StoneDiameter { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Tck
characteristic value of the shear stress limit
Declaration
public double Tck { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source